#define NULL ((void *)0)

int length = 9 ;
//雷区的长度
//
int width  = 9 ;
//雷区的宽度
//
int mnum   = 10 ;
//雷的数量
//
int square = 0 ;
//雷区的面积(方块的个数)
//
int touched  = 0 ;
//已经被探测的区域
//
int **field = NULL ;
//指向雷区
//
int **output = NULL ;
//指向输出数组


char *menustr = "\
-------------------------------------------------\n\
|               欢迎来到扫雷小程序              |\n\
|                                               |\n\
|-----------------------------------------------|\n\
|               1. 开始游戏                     |\n\
|               2. 设置                         |\n\
|               3. 帮助                         |\n\
|               4. 退出程序                     |\n\
|                                               |\n\
|                                               |\n\
-------------------------------------------------\n\
";

char *submenustr = "\
-------------------------------------------------\n\
|               欢迎来到扫雷小程序              |\n\
|                                               |\n\
|-----------------------------------------------|\n\
|               1. 9  * 9  : 10                 |\n\
|               2. 16 * 16 : 40                 |\n\
|               3. 30 * 25 : 99                 |\n\
|               4. 自定义                       |\n\
|               5. 返回上一级                   |\n\
|                                               |\n\
|                                               |\n\
-------------------------------------------------\n\
";

char *helpstr = "\
-------------------------------------------------\n\
|                                               |\n\
|帮助信息                                       |\n\
|                                               |\n\
|       开始游戏后输入对应的坐标探测区域        |\n\
|       可以一次输入多个坐标，不超过10个        |\n\
|       游戏中可输入-1退出程序                  |\n\
|                                               |\n\
-------------------------------------------------\n\
" ;
